Autodesk.Revit.DB.IFC.IFCExtrusionData.GetLoops
Gets the curve loops that form the base shape of the extrusion.
Returns:
The collection of loops.
Since:
2012

Autodesk.Revit.DB.IFC.IFCExtrusionData.ClearLoops
Clears the curve loops stored in the extrusion data.
Since:
2012

Autodesk.Revit.DB.IFC.IFCExtrusionData.RemoveLoopAt(System.Int32)
Removes the loop at the specified index.
index:
The zero-based index of the loop to remove.
Since:
2012

Autodesk.Revit.DB.IFC.IFCExtrusionData.AddLoop(Autodesk.Revit.DB.CurveLoop)
Adds a curve loop to the extrusion data.
pLoop:
The curve loop.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.IFC.IFCExtrusionData.IsValid
Determines if the extrusion data represents a valid extrusion.
Returns:
True if the extrusion is valid, false otherwise.
Since:
2012

Autodesk.Revit.DB.IFC.IFCExtrusionData.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.IFC.IFCExtrusionData.ExtrusionDirection
The direction used for the extrusion.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.IFC.IFCExtrusionData.ExtrusionBasis
The basis used for the extrusion.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2012

Autodesk.Revit.DB.IFC.IFCExtrusionData.ScaledExtrusionLength
The length of the extrusion, scaled in the units of the export.
Since:
2012

Autodesk.Revit.DB.IFC.IFCExtrusionData.#ctor
Constructs a new empty extrusion data object.
Since:
2012

Autodesk.Revit.DB.IFC.IFCExtrusionData
Represents the geometry of an extrusion (a solid body or opening) generated
from Revit geometry.
Since:
2012